Revit 2027 API
CategorySet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CategorySetIterator ForwardIterator()
Public Overridable Function ForwardIterator As CategorySetIterator
public:
virtual CategorySetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CategorySetIterator
override ForwardIterator : unit -> CategorySetIterator
Return Value
CategorySetIterator
Returns a forward moving iterator to the set.
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace